app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('nama')) {
            return redirect()->to(base_url() . "login");
        }
        $data = [];

        $tglHariIni = date('Y-m-d');
        $tglKemarin = date('Y-m-d', strtotime("-1 days"));

        $data["pasienRajalHariIni"] = $this->regPeriksaModel->where('tgl_registrasi', $tglHariIni)->where('status_lanjut', 'Ralan')->countAllResults();
        $data["pasienRajalKemarin"] = $this->regPeriksaModel->where('tgl_registrasi', $tglKemarin)->where('status_lanjut', 'Ralan')->countAllResults();

        $data["pasienRanapHariIni"] = $this->kamarInapModel->where('tgl_masuk <=', $tglHariIni)->where('tgl_keluar >=', $tglHariIni)->countAllResults();
        $data["pasienRanapKemarin"] = $this->kamarInapModel->where('tgl_masuk <=', $tglKemarin)->where('tgl_keluar >=', $tglKemarin)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reg_periksa`
WHERE `tgl_registrasi` = '2025-10-02'
AND `status_lanjut` = 'Ralan'
SELECT COUNT(*) AS `numrows`
FROM `reg_periksa`
WHERE `tgl_registrasi` = '2025-10-02'
AND `status_lanjut` = 'Ranap'
SELECT COUNT(*) AS `numrows`
FROM `kamar_inap`
WHERE `tgl_masuk` <= '2025-10-02'
AND `tgl_keluar` >= '2025-10-02'
SELECT COUNT(*) AS `numrows`
FROM `kamar_inap`
WHERE `tgl_masuk` <= '2025-10-01'
AND `tgl_keluar` >= '2025-10-01'

    public function pasienPerBulan()
    {
        $jenis = $this->request->getPost("jenis");

        $bulan = [
            "Januari",
            "Februari",
            "Maret",
            "April",
            "Mei",
            "Juni",
            "Juli",
            "Agustus",
            "September",
            "Oktober",
            "November",
            "Desember"
        ];

        $index = date("n") - 1;
        $urutanBulan = array_merge(array_slice($bulan, $index + 1), array_slice($bulan, 0, $index + 1));

        $tahunSekarang = date("Y");

        $jumlahPasien = [];

        if ($jenis = "Ralan") {
            for ($i = $index + 1; $i < 12; $i++) {
                $jumlahPasien[] = $this->regPeriksaModel->where('tgl_registrasi >=', ($tahunSekarang - 1) . "-" . ($i + 1) . "-01")->where('tgl_registrasi <=', ($tahunSekarang - 1) . "-" . ($i + 1)  . "-31")->where('status_lanjut', $jenis)->countAllResults();
            }
            for ($i = 0; $i < $index + 1; $i++) {
                $jumlahPasien[] = $this->regPeriksaModel->where('tgl_registrasi >=', $tahunSekarang . "-" . ($i + 1) . "-01")->where('tgl_registrasi <=', $tahunSekarang . "-" . ($i + 1) . "-31")->where('status_lanjut', $jenis)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reg_periksa`
WHERE `tgl_registrasi` >= '2024-11-01'
AND `tgl_registrasi` <= '2024-11-31'
AND `status_lanjut` = 'Ralan'
SELECT COUNT(*) AS `numrows`
FROM `reg_periksa`
WHERE `tgl_registrasi` >= '2025-1-01'
AND `tgl_registrasi` <= '2025-1-31'
AND `status_lanjut` = 'Ralan'