app/Controllers/Login.php

SELECT *
FROM `user`
---
    public function index()
    {
        if (session()->get('nama')) {
            return redirect()->to(base_url() . "dashboard");
        }
        $user = $this->userModel->findAll();

SELECT *
FROM `user`
WHERE `id` = '1'
 LIMIT 1
---
    public function auth()
    {
        $usersModel = new UserModel();
        $username = $this->request->getPost('nama');
        $password = $this->request->getPost('password');
        $user = $usersModel->where('id', $username)->first();