app/Controllers/PersetujuanRajal.php

    public function muatDataPasien()
    {
        echo json_encode($this->pasienPersRajalModel->findAll());
---
SELECT *
FROM `pasienpersrajal`

    public function muatTambahPasien()
    {
        echo json_encode($this->pasienModel->findAll());
---
SELECT *
FROM `pasien`

    public function editPasien()
    {
        $noRm = $this->request->getPost("noRm");
        $data = [
            "keluarga" => $this->request->getPost("namaKeluarga"),
            "noHp" => $this->request->getPost("noTelp")
        ];

        $this->persetujuanRajalModel->where('noRm', $noRm);
        $this->persetujuanRajalModel->update(null, $data);
---
UPDATE `persetujuanrajal` SET `keluarga` = 'Rosalina, Zerlinda, Sunar, susanti, jarjit', `noHp` = '0858660612460'
WHERE `noRm` = '000005'

    public function cetakPersRajal($noRm)
    {
        $dataPasien = $this->pasienPersRajalModel->where('noRm', $noRm)->findAll();
        $pasien = $this->persetujuanRajalModel->where('noRm', $noRm)->findAll();
---
SELECT *
FROM `pasienpersrajal`
WHERE `noRm` = '000019'
SELECT *
FROM `persetujuanrajal`
WHERE `noRm` = '000019'