app/Controllers/SkorPoudji.php

SELECT *
FROM `pasien`
---
    public function muatDataPasien()
    {
        echo json_encode($this->pasienModel->findAll());

SELECT *
FROM `pasien`
WHERE `id` = '5'
---
    public function printSkor($idPasien)
    {
        $dataPasien = $this->pasienModel->where('id', $idPasien)->findAll();